01_Dummy_cases/01_Dynamic_mesh/dynamicMeshMultiRegion/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        action  new;
        type    cellZoneSet;
        name    rotRegion;
        source  boxToCell;
        box     (-0.06 0.048 0) (0.06 0.160 0.160); // Edit box bounds as required
    }
    
);

// ************************************************************************* //
